docs: update ARCHITECTURE.md
